jwy8612/monitor/software/header/_iomXU4v.h
/* GTCCR */
#define GTCCR	(*(volatile unsigned char *)0x43)
#define  TSM      7
#define  PSRASY   1
#define  PSRSYNC  0

/* Watchdog Timer Control Register */
#define WDTCSR	(*(volatile unsigned char *)0x60)
#define WDTCR	(*(volatile unsigned char *)0x60)
#define  WDIF     7
#define  WDIE     6
#define  WDP3     5
#define  WDCE     4
#define  WDE      3
#define  WDP2     2
#define  WDP1     1
#define  WDP0     0

/* OCDR */
#define OCDR	(*(volatile unsigned char *)0x51)
#define MONDR	(*(volatile unsigned char *)0x51)

/* Timer/Counter 0 */
#define OCR0B	(*(volatile unsigned char *)0x48)
#define OCR0A	(*(volatile unsigned char *)0x47)
#define TCNT0	(*(volatile unsigned char *)0x46)
#define TCCR0B	(*(volatile unsigned char *)0x45)
#define  FOC0A    7
#define  FOC0B    6
#define  WGM02    3
#define  CS02     2
#define  CS01     1
#define  CS00     0
#define TCCR0A	(*(volatile unsigned char *)0x44)
#define  COM0A1   7
#define  COM0A0   6
#define  COM0B1   5
#define  COM0B0   4
#define  WGM01    1
#define  WGM00    0

/* Timer/Counter1 */
#define ICR1	(*(volatile unsigned int *)0x86)
#define ICR1L	(*(volatile unsigned char *)0x86)
#define ICR1H	(*(volatile unsigned char *)0x87)
#define OCR1C	(*(volatile unsigned int *)0x8C)
#define OCR1CL	(*(volatile unsigned char *)0x8C)
#define OCR1CH	(*(volatile unsigned char *)0x8D)
#define OCR1B	(*(volatile unsigned int *)0x8A)
#define OCR1BL	(*(volatile unsigned char *)0x8A)
#define OCR1BH	(*(volatile unsigned char *)0x8B)
#define OCR1A	(*(volatile unsigned int *)0x88)
#define OCR1AL	(*(volatile unsigned char *)0x88)
#define OCR1AH	(*(volatile unsigned char *)0x89)
#define TCNT1	(*(volatile unsigned int *)0x84)
#define TCNT1L	(*(volatile unsigned char *)0x84)
#define TCNT1H	(*(volatile unsigned char *)0x85)
#define TCCR1C	(*(volatile unsigned char *)0x82)
#define  FOC1A    7
#define  FOC1B    6
#define  FOC1C    5
#define TCCR1B	(*(volatile unsigned char *)0x81)
#define  ICNC1    7
#define  ICES1    6
#define  WGM13    4
#define  WGM12    3
#define  CS12     2
#define  CS11     1
#define  CS10     0
#define TCCR1A	(*(volatile unsigned char *)0x80)
#define  COM1A1   7
#define  COM1A0   6
#define  COM1B1   5
#define  COM1B0   4
#define  COM1C1   3
#define  COM1C0   2
#define  WGM11    1
#define  WGM10    0

/* Timer/Counter2 */
#define OCR2B	(*(volatile unsigned char *)0xB4)
#define OCR2A	(*(volatile unsigned char *)0xB3)
#define TCNT2	(*(volatile unsigned char *)0xB2)
#define TCCR2B	(*(volatile unsigned char *)0xB1)
#define  FOC2A    7
#define  FOC2B    6
#define  WGM22    3
#define  CS22     2
#define  CS21     1
#define  CS20     0
#define TCCR2A	(*(volatile unsigned char *)0xB0)
#define  COM2A1   7
#define  COM2A0   6
#define  COM2B1   5
#define  COM2B0   4
#define  WGM21    1
#define  WGM20    0

/* Timer/Counter3 */
#define OCR3CH	(*(volatile unsigned char *)0x9D)
#define OCR3CL	(*(volatile unsigned char *)0x9C)
#define OCR3C	(*(volatile unsigned int *)0x9C)
#define OCR3BH	(*(volatile unsigned char *)0x9B)
#define OCR3BL	(*(volatile unsigned char *)0x9A)
#define OCR3B	(*(volatile unsigned int *)0x9A)
#define OCR3AH	(*(volatile unsigned char *)0x99)
#define OCR3AL	(*(volatile unsigned char *)0x98)
#define OCR3A	(*(volatile unsigned int *)0x98)
#define ICR3H	(*(volatile unsigned char *)0x97)
#define ICR3L	(*(volatile unsigned char *)0x96)
#define ICR3	(*(volatile unsigned int *)0x96)
#define TCNT3H	(*(volatile unsigned char *)0x95)
#define TCNT3L	(*(volatile unsigned char *)0x94)
#define TCNT3	(*(volatile unsigned int *)0x94)
#define TCCR3C	(*(volatile unsigned char *)0x92)
#define  FOC3A    7
#define TCCR3B	(*(volatile unsigned char *)0x91)
#define  ICNC3    7
#define  ICES3    6
#define  WGM33    4
#define  WGM32    3
#define  CS32     2
#define  CS31     1
#define  CS30     0
#define TCCR3A	(*(volatile unsigned char *)0x90)
#define  COM3A1   7
#define  COM3A0   6
#define  COM3B1   5
#define  COM3B0   4
#define  COM3C1   3
#define  COM3C0   2
#define  WGM31    1
#define  WGM30    0

/* Timer/Counter4 */
#define DT4 	(*(volatile unsigned char *)0xD4)
#define  DT4H3    7
#define  DT4H2    6
#define  DT4H1    5
#define  DT4H0    4
#define  DT4L3    3
#define  DT4L2    2
#define  DT4L1    1
#define  DT4L0    0
#define OCR4D	(*(volatile unsigned char *)0xD2)
#define OCR4C	(*(volatile unsigned char *)0xD1)
#define OCR4B	(*(volatile unsigned char *)0xD0)
#define OCR4A	(*(volatile unsigned char *)0xCF)
#define TC4H	(*(volatile unsigned char *)0xBE)
#define TCNT4	(*(volatile unsigned char *)0xBF)
#define TCCR4E	(*(volatile unsigned char *)0xC4)
#define  TLOCK4   7
#define  ENHC4    6
#define  OC4OE5   5
#define  OC4OE4   4
#define  OC4OE3   3
#define  OC4OE2   2
#define  OC4OE1   1
#define  OC4OE0   0
#define TCCR4D	(*(volatile unsigned char *)0xC3)
#define  FPIE4    7
#define  FPEN4    6
#define  FPNC4    5
#define  FPES4    4
#define  FPAC4    3
#define  FPF4     2
#define  WGM41    1
#define  WGM40    0
#define TCCR4C	(*(volatile unsigned char *)0xC2)
#define  COM4A1S  7
#define  COM4A0S  6
#define  COM4B1S  5
#define  COM4B0S  4
#define  COM4D1   3
#define  COM4D0   2
#define  FOC4D    1
#define  PWM4D    0
#define TCCR4B	(*(volatile unsigned char *)0xC1)
#define  PWM4X    7
#define  PSR4     6
#define  DTPS41   5
#define  DTPS40   4
#define  CS43     3
#define  CS42     2
#define  CS41     1
#define  CS40     0
#define TCCR4A	(*(volatile unsigned char *)0xC0)
#define  COM4A1   7
#define  COM4A0   6
#define  COM4B1   5
#define  COM4B0   4
#define  FOC4A    3
#define  FOC4B    2
#define  PWM4A    1
#define  PWM4B    0

/* Oscillator Calibration Register */
#define OSCCAL	(*(volatile unsigned char *)0x66)

/* RC oscillator control register */
#define RCCTRL	(*(volatile unsigned char *)0x67)
#define  RCFREQ   0

/* clock prescaler control register */
#define CLKPR	(*(volatile unsigned char *)0x61)
#define  CLKPCE   7
#define  CLKPS3   3
#define  CLKPS2   2
#define  CLKPS1   1
#define  CLKPS0   0

/* clock control registers */
#define CLKSTA	(*(volatile unsigned char *)0xC7)
#define  RCON     1
#define  EXTON    0
#define CLKSEL1	(*(volatile unsigned char *)0xC6)
#define  RCCKSEL3 7
#define  RCCKSEL2 6
#define  RCCKSEL1 5
#define  RCCKSEL0 4
#define  EXCKSEL3 3
#define  EXCKSEL2 2
#define  EXCKSEL1 1
#define  EXCKSEL0 0
#define CLKSEL0	(*(volatile unsigned char *)0xC5)
#define  RCSUT1   7
#define  RCSUT0   6
#define  EXSUT1   5
#define  EXSUT0   4
#define  RCE      3
#define  EXTE     2
#define  CLKS     0

