jwy8612/monitor/software/header/_iomXU4v.h
/* PLL control register */
#define PLLCSR	(*(volatile unsigned char *)0x49)
#define  PINDIV   4
#define  PLLE     1
#define  PLOCK    0
#define PLLFRQ	(*(volatile unsigned char *)0x52)
#define  PINMUX   7
#define  PLLUSB   6
#define  PLLTM1   5
#define  PLLTM0   4
#define  PDIV3    3
#define  PDIV2    2
#define  PDIV1    1
#define  PDIV0    0

/* PRR */
#define PRR0	(*(volatile unsigned char *)0x64)
#define  PRTWI    7
#define  PRTIM2   6
#define  PRTIM0   5
#define  PRTIM1   3
#define  PRSPI    2
#define  PRADC    0
#define PRR1	(*(volatile unsigned char *)0x65)
#define  PRUSB    7
#define  PRTIM4   4
#define  PRTIM3   3
#define  PRUSART1 0

/* MCU */
#define MCUSR	(*(volatile unsigned char *)0x54)
#define  USBRF    5
#define  JTRF     4
#define  WDRF     3
#define  BORF     2
#define  EXTRF    1
#define  PORF     0
#define MCUCR	(*(volatile unsigned char *)0x55)
#define  JTD      7
#define  PUD      4
#define  IVSEL    1
#define  IVCE     0

#define SMCR	(*(volatile unsigned char *)0x53)
#define  SM2      3
#define  SM1      2
#define  SM0      1
#define  SE       0

/* SPM Control and Status Register */
#define SPMCSR	(*(volatile unsigned char *)0x57)
#define  SPMIE    7
#define  RWWSB    6
#define  SIGRD    5
#define  RWWSRE   4
#define  BLBSET   3
#define  PGWRT    2
#define  PGERS    1
#define  SPMEN    0

/* Timer/Counter Interrupts */
#define TIFR0	(*(volatile unsigned char *)0x35)
#define  OCF0B    2
#define  OCF0A    1
#define  TOV0     0
#define TIMSK0	(*(volatile unsigned char *)0x6E)
#define  OCIE0B   2
#define  OCIE0A   1
#define  TOIE0    0
#define TIFR1	(*(volatile unsigned char *)0x36)
#define  ICF1     5
#define  OCF1C    3
#define  OCF1B    2
#define  OCF1A    1
#define  TOV1     0
#define TIMSK1	(*(volatile unsigned char *)0x6F)
#define  ICIE1    5
#define  OCIE1C   3
#define  OCIE1B   2
#define  OCIE1A   1
#define  TOIE1    0
#define TIFR2	(*(volatile unsigned char *)0x37)
#define  OCF2B    2
#define  OCF2A    1
#define  TOV2     0
#define TIMSK2	(*(volatile unsigned char *)0x70)
#define  OCIE2B   2
#define  OCIE2A   1
#define  TOIE2    0
#define TIFR3	(*(volatile unsigned char *)0x38)
#define  ICF3     5
#define  OCF3C    3
#define  OCF3B    2
#define  OCF3A    1
#define  TOV3     0
#define TIMSK3	(*(volatile unsigned char *)0x71)
#define  ICIE3    5
#define  OCIE3C   3
#define  OCIE3B   2
#define  OCIE3A   1
#define  TOIE3    0
#define TIFR4	(*(volatile unsigned char *)0x39)
#define  OCF4D    7
#define  OCF4A    6
#define  OCF4B    5
#define  TOV4     2
#define TIMSK4	(*(volatile unsigned char *)0x72)
#define  OCIE4D   7
#define  OCIE4A   6
#define  OCIE4B   5
#define  TOIE4    2

/* External Interrupts */
#define EIFR	(*(volatile unsigned char *)0x3C)
#define  INTF6    6
#define  INTF3    3
#define  INTF2    2
#define  INTF1    1
#define  INTF0    0
#define EIMSK	(*(volatile unsigned char *)0x3D)
#define  INT6     6
#define  INT3     3
#define  INT2     2
#define  INT1     1
#define  INT0     0
#define EICRB	(*(volatile unsigned char *)0x6A)
#define  ISC61    5
#define  ISC60    4
#define EICRA	(*(volatile unsigned char *)0x69)
#define  ISC31    7
#define  ISC30    6
#define  ISC21    5
#define  ISC20    4
#define  ISC11    3
#define  ISC10    2
#define  ISC01    1
#define  ISC00    0

/* Pin Change Interrupts */
#define PCIFR	(*(volatile unsigned char *)0x3B)
#define  PCIF0    0
#define PCICR	(*(volatile unsigned char *)0x68)
#define  PCIE0    0
#define PCMSK0	(*(volatile unsigned char *)0x6B)

/* GPIO */
#define GPIOR0	(*(volatile unsigned char *)0x3E)
#define GPIOR1	(*(volatile unsigned char *)0x4A)
#define GPIOR2	(*(volatile unsigned char *)0x4B)

/* Stack Pointer */
#define SP  	(*(volatile unsigned int *)0x5D)
#define SPL 	(*(volatile unsigned char *)0x5D)
#define SPH 	(*(volatile unsigned char *)0x5E)

/* Status REGister */
#define SREG	(*(volatile unsigned char *)0x5F)


/* io bits */

/* Port B */
#define  PORTB7   7
#define  PORTB6   6
#define  PORTB5   5
#define  PORTB4   4
#define  PORTB3   3
#define  PORTB2   2
#define  PORTB1   1
#define  PORTB0   0
#define  PB7      7
#define  PB6      6
#define  PB5      5
#define  PB4      4
#define  PB3      3
#define  PB2      2
#define  PB1      1
#define  PB0      0
#define  DDB7     7
#define  DDB6     6
#define  DDB5     5
#define  DDB4     4
#define  DDB3     3
#define  DDB2     2
#define  DDB1     1
#define  DDB0     0
#define  PINB7    7
#define  PINB6    6
#define  PINB5    5
#define  PINB4    4
#define  PINB3    3
#define  PINB2    2
#define  PINB1    1
#define  PINB0    0

/* Port C */
#define  PORTC7   7
#define  PORTC6   6
#define  PC7      7
#define  PC6      6
#define  DDC7     7
#define  DDC6     6
#define  PINC7    7
#define  PINC6    6

/* Port D */
#define  PORTD7   7
#define  PORTD6   6
#define  PORTD5   5
#define  PORTD4   4
#define  PORTD3   3
#define  PORTD2   2
#define  PORTD1   1
#define  PORTD0   0
#define  PD7      7
#define  PD6      6
#define  PD5      5
#define  PD4      4
#define  PD3      3
#define  PD2      2
#define  PD1      1
#define  PD0      0
#define  DDD7     7
#define  DDD6     6
#define  DDD5     5
#define  DDD4     4
#define  DDD3     3
#define  DDD2     2
#define  DDD1     1
#define  DDD0     0
#define  PIND7    7
#define  PIND6    6
#define  PIND5    5
#define  PIND4    4
#define  PIND3    3
#define  PIND2    2
#define  PIND1    1
#define  PIND0    0

/* Port E */
#define  PORTE6   6
#define  PORTE2   2
#define  PE6      6
#define  PE2      2
#define  DDE6     6
#define  DDE2     2
#define  PINE6    6
#define  PINE2    2

/* Port F */
#define  PORTF7   7
#define  PORTF6   6
#define  PORTF5   5
#define  PORTF4   4
#define  PORTF1   1
#define  PORTF0   0
#define  PF7      7
#define  PF6      6
#define  PF5      5
#define  PF4      4
#define  PF1      1
#define  PF0      0
#define  DDF7     7
#define  DDF6     6
#define  DDF5     5
#define  DDF4     4
#define  DDF1     1
#define  DDF0     0
#define  PINF7    7
#define  PINF6    6
#define  PINF5    5
#define  PINF4    4
#define  PINF1    1
#define  PINF0    0

/* PCMSK0 */
#define  PCINT7   7
#define  PCINT6   6
#define  PCINT5   5
#define  PCINT4   4
#define  PCINT3   3
#define  PCINT2   2
#define  PCINT1   1
#define  PCINT0   0


/* USB */
#define UHWCON	(*(volatile unsigned char *)0xD7)
#define  UVREGE   0
#define USBCON	(*(volatile unsigned char *)0xD8)
#define  USBE     7
#define  FRZCLK   5
#define  OTGPADE  4
#define  VBUSTE   0
#define USBSTA	(*(volatile unsigned char *)0xD9)
#define  ID       1
#define  VBUS     0
#define USBINT	(*(volatile unsigned char *)0xDA)
#define  VBUSTI   0

